### Snapshot Service Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=abc88590832cb6a61fa3246fe5b891ca98ac78cc]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=2bd817ceecdf6df3a7be655f007dfc9f9ad228a1]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/4127341138294685345]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=351262687]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=d9bc47f2-23ba-4440-ade5-e89f5ade6d5d]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.daily_snapshot.digitalocean_droplet.forest has been deleted
  - resource "digitalocean_droplet" "forest" {
      - id                   = "351262687" -> null
      - ipv4_address         = "209.38.248.91" -> null
        name                 = "forest-snapshot-calibnet"
        tags                 = [
            "iac",
        ]
      - urn                  = "do:droplet:351262687" -> null
        # (22 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest will be created
  + resource "digitalocean_droplet" "forest" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "fedora-36-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "forest-snapshot-calibnet"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-4vcpu-8gb"
      + ssh_keys             = [
          + "00:a0:c0:54:5f:40:22:10:52:8a:04:48:f9:c8:db:00",
          + "04:77:74:e8:81:92:9d:1e:cb:d3:5d:0d:fa:83:56:f6",
          + "09:b6:09:ef:ac:23:8a:94:df:3e:b9:9b:28:8d:c8:6f",
          + "31:fd:e9:da:70:df:ef:33:af:a2:ea:a1:fd:69:a7:9d",
          + "37:1e:1a:fc:25:2d:5a:a7:1f:49:b2:6d:53:5c:0e:45",
          + "41:91:6d:f9:f7:27:44:30:7f:a4:6f:36:e8:97:ad:cb",
          + "58:d8:c7:2a:ce:84:ca:41:10:06:93:35:34:6d:eb:a2",
          + "5f:d6:ad:06:b8:2d:4a:ef:0a:ac:97:bf:37:b0:7a:4c",
          + "68:35:f7:50:11:68:7b:df:9d:6a:49:83:eb:e9:37:20",
          + "77:09:d9:32:61:65:81:08:d1:e2:50:9b:ec:28:02:62",
          + "93:73:5f:22:81:11:ae:80:f0:63:0d:a7:09:4b:2d:2a",
          + "99:ea:ec:bf:9f:d1:b2:52:02:b2:78:a2:57:25:a0:e7",
          + "9c:18:88:44:c4:d6:74:84:07:9a:3c:9a:f6:17:f3:e4",
          + "9d:f6:f8:05:f7:c2:72:a2:b7:ce:f8:3e:71:12:2e:09",
          + "a1:82:1c:8d:82:65:91:0f:3b:ca:06:37:6f:e0:5a:11",
          + "a4:01:b5:d9:4c:3f:93:71:9b:02:83:66:5e:4f:62:25",
          + "c7:f9:b0:49:24:aa:30:36:4e:5f:d4:a3:ab:43:49:e8",
          + "cb:ca:60:61:a9:ba:e0:a0:ba:95:35:2d:48:f3:c2:05",
          + "d3:6d:af:8e:a4:b9:8f:b8:38:2b:56:06:5f:38:48:a7",
          + "f7:de:2d:83:ce:e7:c3:13:2c:ca:3a:f0:4b:4e:46:da",
          + "fa:f4:ba:d9:24:81:12:25:88:43:3a:f0:07:7c:af:6e",
          + "fe:42:94:20:d0:a9:24:67:5f:de:78:c1:bb:8b:6c:92",
        ]
      + status               = (known after apply)
      + tags                 = [
          + "iac",
        ]
      + urn                  = (known after apply)
      + user_data            = "bd57a7db5f4cc4d262555fe2d89bb027d715d3bc"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [] -> (known after apply)
        id              = "d9bc47f2-23ba-4440-ade5-e89f5ade6d5d"
        name            = "forest-snapshot-calibnet"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "209.38.248.91",
        ],
      + [
          + null,
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>